/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putnbr_fd.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yuharada <yuharada@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/05/11 17:55:02 by yuharada          #+#    #+#             */
/*   Updated: 2025/05/24 16:19:59 by yuharada         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//指定したファイルディスクリプタに整数を書き込む

#include <unistd.h>

void	ft_putnbr_fd(int n, int fd)
{
	if (n == -2147483648)
	{
		write(fd, "-2147483648", 11);
		return ;
	}
	if (n < 0)
	{
		write(fd, "-", 1);
		n = -n;
	}
	if (n >= 10)
		ft_putnbr_fd(n / 10, fd);
	write(fd, &"0123456789"[n % 10], 1);
}

// int	main(void)
// {
// 	ft_putnbr_fd(234523, 1);
// 	return  (0);
// }
