/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putchar_fd.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yuharada <yuharada@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/05/11 17:49:26 by yuharada          #+#    #+#             */
/*   Updated: 2025/05/11 17:49:56 by yuharada         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//指定したファイルディスクリプタに1文字書き込む

#include <unistd.h>

void	ft_putchar_fd(char c, int fd)
{
	write(fd, &c, 1);
}
