/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_tolower.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: yuharada <yuharada@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/04/28 17:55:08 by yuharada          #+#    #+#             */
/*   Updated: 2025/05/11 18:17:37 by yuharada         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//大文字を小文字に変換

int	ft_tolower(int c)
{
	if (c >= 'A' && c <= 'Z')
	{
		return (c - 'A' + 'a');
	}
	else
		return (c);
}

// #include <stdio.h>

// int	main(void)
// {
// 	char	a = ft_tolower('u');
// 	printf("%c\n", a);
// 	return (0);
// }
